# <center> CAPSTONE PROJECTS </center>

## 1: PYTHON'S FOUNDATION

#### Question 1.1:

Given a string `s` consists of some words separated by spaces, return the length of the last word in the string. If the last word does not exist, return 0. A word is a maximal substring consisting of non-space characters only.

|Input   |Function                                                    | Output|
|-|-|-|
|`s="Hello World"` |Check the last word `World` has how many characters?|   5   |
|`s=" "`           |Check the last word ` ` has how many characters?    |   0   |

In [ ]:
def len_last_word(s):
    # Your code here
    return

In [ ]:
s = "Hello World"
assert len_last_word(s) == 5, "Wrong answer, please calculate again"

s = " "
assert len_last_word(s) == 0, "Wrong answer, please calculate again"

In [1]:
def len_last_word(s):
    s=s.split() 
    if len(s) == 0:
        return 0
    else:
        return len(s[-1])

In [2]:
s = "Hello World"
assert len_last_word(s) == 5, "Wrong answer, please calculate again"

s = " "
assert len_last_word(s) == 0, "Wrong answer, please calculate again"

#### Question 1.2:

An integer `d` is a divisor of an integer `n` if `n % d = 0`.
Given an integer `n`, count the number of `d` occuring within the integer.

**Examples**:

|Input   |Function                                        | Output|
|-|-|-|
|`n=124` |Check if `1`,`2`, and `4`  are divisors of `124`|   3   |
|`n=100` |Check if `1` and `0` are divisors of `100`      |   1   |
|`n=13`  |Check if `1`  and `3`  are divisors of `13`     |   1   |

Hints: using `loops` (i.e `for`, ...) or `comprehension`.

In [ ]:
def find_digits(n): 
    # Your code here
    return

In [ ]:
n = 124
assert find_digits(n) == 3, "Wrong answer, please calculate again"

n = 100
assert find_digits(n) == 1, "Wrong answer, please calculate again"

n = 13
assert find_digits(n) == 1, "Wrong answer, please calculate again"

In [3]:
def find_digits(n): 
    return len([1 for i in str(n) if i!='0' and n%int(i)==0])

In [4]:
n = 124
assert find_digits(n) == 3, "Wrong answer, please calculate again"

n = 100
assert find_digits(n) == 1, "Wrong answer, please calculate again"

n = 13
assert find_digits(n) == 1, "Wrong answer, please calculate again"

## 2: NUMPY, PANDAS

### Question 1.2: NumPy

Given an array of 2 dimension `A`, return the minimum value of the second dimension.
For examples:

|Input|Output|
|-|-|
|```A = np.array([[2, 59],[3, 17], [1, 33], [45, 0]])```|`[2 3 1 0]`|
|```A = np.array([[22, 21],[35, 1], [12, 3], [5, 80]])```|`[21 1 3 5]`|

In [ ]:
def min_value(A):
    return

In [ ]:
import numpy as np
A = np.array([[2, 5], [3, 7], [1, 3], [4, 0]])
min_value(A)

In [5]:
def min_value(A):
    li=[]
    for i in list(range(A.shape[0])):
        li.append(min(A[i]))
    return li

In [6]:
import numpy as np
A = np.array([[2, 5], [3, 7], [1, 3], [4, 0]])
min_value(A)

[2, 3, 1, 0]

In [22]:
def min_value(A):
    return np.amin(A, axis=1)

In [23]:
import numpy as np
A = np.array([[2, 5], [3, 7], [1, 3], [4, 0]])
min_value(A)

array([2, 3, 1, 0])

### Question 2.2: Pandas

#### Step 1. Import the necessary libraries

In [8]:
import pandas as pd

#### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user) and assign it to a variable called `users`.

In [26]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users = pd.read_csv(url, sep = '|')
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

#### Step 3. Select all records of women whose age is between 20 and 40 that work as technician.

In [33]:
users.query("gender=='F' & occupation=='technician' & age <= 40 & age >= 20")

     user_id  age gender  occupation zip_code
937      938   38      F  technician    55038

In [37]:
Set1 = ((users.gender=='F') & (users.occupation=='technician') & (users.age.between(20,40)))
users.loc[Set1]

     user_id  age gender  occupation zip_code
937      938   38      F  technician    55038

#### Step 4. For each occupation, calculate the minimum and maximum ages

In [43]:
users.groupby(['occupation']).agg({'age':['min', 'max']})

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70
entertainment  15  50
executive      22  69
healthcare     22  62
homemaker      20  50
lawyer         21  53
librarian      23  69
marketing      24  55
none           11  55
other          13  64
programmer     20  63
retired        51  73
salesman       18  66
scientist      23  55
student         7  42
technician     21  55
writer         18  60

In [44]:
users.groupby(['occupation']).age.min().to_frame()

               age
occupation
administrator   21
artist          19
doctor          28
educator        23
engineer        22
entertainment   15
executive       22
healthcare      22
homemaker       20
lawyer          21
librarian       23
marketing       24
none            11
other           13
programmer      20
retired         51
salesman        18
scientist       23
student          7
technician      21
writer          18

## 3: VISUALIZATION

## 3: VISUALIZATION

#### Step 1. Import the necessary libraries (seaborn, matplotlib)

In [45]:
users.groupby(['occupation']).age.max().to_frame()

               age
occupation
administrator   70
artist          48
doctor          64
educator        63
engineer        70
entertainment   50
executive       69
healthcare      62
homemaker       50
lawyer          53
librarian       69
marketing       55
none            55
other           64
programmer      63
retired         73
salesman        66
scientist       55
student         42
technician      55
writer          60

#### Step 2. Import the dataset `titanic` from `sns.load_dataset()` and assign it to a variable called `titanic`.

In [46]:
import seaborn as sns
import matplotlib.pyplot as plt

#### Step 3: Plot distribution of 'fare' using `sns.histplot()`

#### Step 4: Plot distribution of 'age' with 3 difference `class` using `sns.boxplot()`

#### Step 5: Plot correlation matrix using `sns.heatmap()`

## 4: MACHINE LEARNING with PIMA INDIANS DIABETES DATASET

The Pima Indian Diabetes Dataset, originally from the National Institute of Diabetes and Digestive and Kidney Diseases, contains information of 768 women from a population near Phoenix, Arizona, USA. The outcome tested was Diabetes, 258 tested positive and 500 tested negative. Therefore, there is one target (dependent) variable `Outcome` and the following attributes (TYNECKI, 2018):

|        Features        |Descriptions|
|           -            |-|
|Pregnancies             |Number of times pregnant|
|Glucose                 |Oral glucose tolerance test - OGTT (two hour plasma glucose concentration after 75g anhydrous glucose in mg/dl)|
|BloodPressure           |Blood Pressure (Diastolic Blood Pressure in mmHg)|
|SkinThickness           |Skin Thickness (Triceps skin fold thickness in mm)|
|Insulin                 |Insulin (2 h serum insulin in mu U/ml)|
|BMI                     |BMI (Body Mass Index in kg/m2)|
|DiabetesPedigreeFunction| Pedigree Diabetes Function ('function that represents how likely they are to get the disease by extrapolating from their ancestorâ€™s history')|
|Age                     |Age (years)|


The objective of this capstone project is to use Machine Learning (e.g, logistic regression, svm, random forest, ...) to predict whether a patient has diabetes or not (binary classification) given 7 features mentionned above.

#### Step 1. Import the necessary libraries (pandas, numpy, seaborn, sklearn)

#### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/npradaschnor/Pima-Indians-Diabetes-Dataset/master/diabetes.csv) and assign it to a variable called `pima`.

#### Step 3. Check the DataFrame Information, Descriptive Statistics and Analysis of dataset
**Hints**: Check dimension of the data, data type for each attribute, describe the distribution for each attribute, the percentage of missing values, detect ouliers, ...

#### Step 4. EDA & Visualization 
**Hints**: Plot attributes distributions, correlation, pairplot to find insights in attributes combinations, ...

#### Step 5. Feature Engineering
**Hints**: Handle missing values, outliers, transform original attributes to meaningful features,...

#### Step 6. Train models
**Hints**: `LogisticRegression`, `SVM`,...

#### Step 7. Predict on new data

#### Step 8. Evaluate the model
**Hints**: Suggested metrics include `accuracy_score`, `confusion_matrix`,`classification_report`,...